# Задание 5.11

Алгоритм получает на вход натуральное число N > 1 и строит по нему новое число R следующим образом:

1. Строится двоичная запись числа N.

2. Подсчитывается количество нулей и единиц в полученной записи. Если их количество одинаково, в конец записи добавляется её последняя цифра. В противном случае в конец записи добавляется цифра, которая встречается реже.

3. Шаг 2 повторяется ещё два раза.

4. Результат переводится в десятичную систему счисления.

При каком наименьшем исходном числе N > 93 в результате работы алгоритма получится число, кратное 6? 

<details>
<summary>Ответ</summary>
111
</details>

<details>
<summary>Решение</summary>

```python
for n in range(94, 1000):
    r = bin(n)[2:]
    if r.count(’1’) == r.count(’0’):
        r = r + r[-1]
    elif r.count(’1’) > r.count(’0’):
        r = r + ’0’
    else:
        r = r + ’1’
    if r.count(’1’) == r.count(’0’):
        r = r + r[-1]
    elif r.count(’1’) > r.count(’0’):
        r = r + ’0’
    else:
        r = r + ’1’
    if r.count(’1’) == r.count(’0’):
        r = r + r[-1]
    elif r.count(’1’) > r.count(’0’):
        r = r + ’0’
    else:
        r = r + ’1’
    r = int(r, 2)
    if r % 6 == 0:
        print(n)
```

</details>
