# Задание 5.13

Автомат получает на вход четырехзначное число. По этому числу строится новое число по следующим правилам.

1. Складываются первая и вторая, а также третья и четвертая цифры исходного числа;

2. Полученные два числа записываются друг за другом в порядке неубывания (без разделителей).

Пример. Исходное число: 2491 . Суммы: 2 + 4 = 6 ; 9 + 1 = 10 . Результат: 610 .

Укажите наименьшее число, в результате обработки которого автомат выдаст число 1218 . 

<details>
<summary>Ответ</summary>
3999
</details>

<details>
<summary>Решение</summary>

```python
for k in range(1000, 10000):
    s1 = int(str(k)[0]) + int(str(k)[1])
    s2 = int(str(k)[2]) + int(str(k)[3])
    if str(min(s1, s2)) + str(max(s1, s2)) == ’1218’:
        print(k)
        break
```

</details>
