### Задача 1: Приветствие пользователя
**Тема**: Ввод и вывод данных  
**Описание**: Напишите программу, которая запрашивает имя пользователя и приветствует его.

<details>
<summary>Решение</summary>

```python
# Пример ввода:
# Введите ваше имя: Анна
# Пример вывода:
# Привет, Анна!

name = input("Введите ваше имя: ")
print(f"Привет, {name}!")
```

</details>

---

### Задача 2: Сравнение чисел
**Тема**: Условные операторы  
**Описание**: Напишите программу, которая запрашивает два числа и выводит, какое из них больше.

<details>
<summary>Решение</summary>

```python
# Пример ввода:
# Введите первое число: 5
# Введите второе число: 10
# Пример вывода:
# Второе число больше.

num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))
if num1 > num2:
    print("Первое число больше.")
elif num1 < num2:
    print("Второе число больше.")
else:
    print("Числа равны.")
```

</details>

---

### Задача 3: Четные числа в диапазоне
**Тема**: Циклы  
**Описание**: Напишите программу, которая выводит все четные числа в заданном пользователем диапазоне.

<details>
<summary>Решение</summary>

```python
# Пример ввода:
# Начало диапазона: 2
# Конец диапазона: 10
# Пример вывода:
# 2 4 6 8 10

start = int(input("Начало диапазона: "))
end = int(input("Конец диапазона: "))
for i in range(start, end + 1):
    if i % 2 == 0:
        print(i, end=" ")
```

</details>

---

### Задача 4: Факториал числа
**Тема**: Функции  
**Описание**: Напишите функцию, которая принимает число и возвращает его факториал.

<details>
<summary>Решение</summary>

```python
# Пример ввода:
# Введите число: 5
# Пример вывода:
# Факториал числа: 120

def factorial(n):
    result = 1
    for i in range(1, n + 1):
        result *= i
    return result

num = int(input("Введите число: "))
print(f"Факториал числа: {factorial(num)}")
```

</details>

---

### Задача 5: Фибоначчи через рекурсию
**Тема**: Рекурсия  
**Описание**: Напишите функцию, которая вычисляет n-е число Фибоначчи рекурсивно.

<details>
<summary>Решение</summary>

```python
# Пример ввода:
# Введите номер числа Фибоначчи: 7
# Пример вывода:
# 13

def fibonacci(n):
    if n <= 1:
        return n
    return fibonacci(n - 1) + fibonacci(n - 2)

num = int(input("Введите номер числа Фибоначчи: "))
print(fibonacci(num))
```

</details>

---

### Задача 6: Проверка числа на четность
**Тема**: Условные операторы  
**Описание**: Напишите программу, которая проверяет, является ли введенное число четным или нечетным.

<details>
<summary>Решение</summary>

```python
num = int(input("Введите число: "))
if num % 2 == 0:
    print("Число четное.")
else:
    print("Число нечетное.")
```

</details>

---

### Задача 7: Таблица умножения
**Тема**: Циклы  
**Описание**: Напишите программу, которая выводит таблицу умножения для введенного числа.

<details>
<summary>Решение</summary>

```python
# Пример ввода:
# Введите число: 3
# Пример вывода:
# 3 x 1 = 3
# 3 x 2 = 6
# ...
# 3 x 10 = 30

num = int(input("Введите число: "))
for i in range(1, 11):
    print(f"{num} x {i} = {num * i}")
```

</details>

---
