# Задание 23

Найти сумму цифр числа не так сложно, но что, если чисел несколько?
Напишите программу для выполнения этого действия.

В первой строке указано число N Во всех последующих N строках написано по одному числу.

Требуется вывести общую сумму цифр всех введённых чисел (кроме N).

<details>
<summary>Решение</summary>

```python
n = int(input())
ans = 0
for _ in range(n):
    s = input()
    for x in s:
        ans += int(x)

print(ans)
```

</details>
